Table of Contents
 Class FemElement
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Provides information about FEM element
[Serializable]
[DataContract]
public class FemElement
Inheritance
object
FemElement
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 FemElement()
Constructor
public FemElement()
 FemElement(int, int, int)
Constructor for triangular element 2d
public FemElement(int node1, int node2, int node3)
Parameters
node1 int
node2 int
node3 int
 FemElement(int, int, int, int)
Constructor for quadrilateral element 2D
public FemElement(int node1, int node2, int node3, int node4)
Parameters
node1 int
node2 int
node3 int
node4 int
Properties
 Type
Type of the finite element 1 - triangular element 2D 2 - quadrilateral element 2D
[DataMember]
public int Type { get; set; }
Property Value
int
 Vertices
Get list of vertices of the fem element
[DataMember]
public List<int> Vertices { get; set; }
Property Value
List<int>
 Edit this page